In [1]:
import numpy as np
import pandas as pd 
import matplotlib.pyplot as plt

In [10]:
# importing the data 

data = pd.read_csv(r'automobile_prices_economics_2019_2023.csv')

In [28]:
# Getting the gist of the data 

data.head()

data.describe()

,Month/Year,New Price ($),Used Price ($),Inflation Rate (%),Interest Rate (%),Units Sold
count,60,60,60,60,60,60
unique,60,17,43,46,18,49
top,19-Jan,"25,000","14,700",1.40%,0.25%,"29,000"
freq,1,12,2,3,23,4

In [4]:
data.head()

,Month/Year,New Price ($),Used Price ($),Inflation Rate (%),Interest Rate (%),Units Sold
0,19-Jan,"25,000","18,000",1.60%,2.40%,"28,500"
1,19-Feb,"25,000","17,900",1.50%,2.40%,"29,000"
2,19-Mar,"25,000","17,800",1.90%,2.40%,"31,500"
3,19-Apr,"25,000","17,700",2.00%,2.40%,"30,000"
4,19-May,"25,000","17,600",1.80%,2.40%,"32,000"

Info about the dataset. 

1. It Has 6 columns {'Month/Year', 'New Price ($)', 'Used Price ($)', 'Inflation Rate (%)',
       'Interest Rate (%)', 'Units Sold'}

2. 60 rows. with 0 null values.

In [14]:
data.describe()

,Month/Year,New Price ($),Used Price ($),Inflation Rate (%),Interest Rate (%),Units Sold
count,60,60,60,60,60,60
unique,60,17,43,46,18,49
top,19-Jan,"25,000","14,700",1.40%,0.25%,"29,000"
freq,1,12,2,3,23,4

# Preprocessing

In [40]:


data['Inflation Rate (%)'] =  data['Inflation Rate (%)'].astype(str).str.replace("%", "").astype(float)
data['Interest Rate (%)'] =  data['Interest Rate (%)'].astype(str).str.replace("%", "").astype(float)
data['New Price ($)'] = data['New Price ($)'].astype(str).str.replace(",", "").astype(float)
data['Used Price ($)'] = data['Used Price ($)'].astype(str).str.replace(",", "").astype(float)
data['Month/Year'] = pd.to_datetime(data['Month/Year'], format='%y-%b')

data['Units Sold'] = data['Units Sold'].astype(str).str.replace(",", "").astype(float)  

data.head()

,Month/Year,New Price ($),Used Price ($),Inflation Rate (%),Interest Rate (%),Units Sold
0,2019-01-01,25000.0,18000.0,1.6,2.4,28500.0
1,2019-02-01,25000.0,17900.0,1.5,2.4,29000.0
2,2019-03-01,25000.0,17800.0,1.9,2.4,31500.0
3,2019-04-01,25000.0,17700.0,2.0,2.4,30000.0
4,2019-05-01,25000.0,17600.0,1.8,2.4,32000.0